SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

INSERT INTO `infra_job` (`id`, `name`, `status`, `handler_name`, `handler_param`, `cron_expression`, `retry_count`, `retry_interval`, `monitor_timeout`, `creator`, `create_time`, `updater`, `update_time`, `deleted`) VALUES
('5', '支付通知 Job', '2', 'payNotifyJob', NULL, '* * * * * ?', 0, 0, 0, 1, '2021-10-27 08:34:42', 1, '2024-09-12 13:32:48', 0),
('17', '支付订单同步 Job', '2', 'payOrderSyncJob', NULL, '0 0/1 * * * ?', 0, 0, 0, 1, '2023-07-22 14:36:26', 1, '2023-07-22 15:39:08', 0),
('18', '支付订单过期 Job', '2', 'payOrderExpireJob', NULL, '0 0/1 * * * ?', 0, 0, 0, 1, '2023-07-22 15:36:23', 1, '2023-07-22 15:39:54', 0),
('19', '退款订单的同步 Job', '2', 'payRefundSyncJob', NULL, '0 0/1 * * * ?', 0, 0, 0, 1, '2023-07-23 21:03:44', 1, '2023-07-23 21:09:00', 0),
('21', 'Mall 交易订单的自动过期 Job', '2', 'tradeOrderAutoCancelJob', '', '0 * * * * ?', '3', 0, 0, 1, '2023-09-25 23:43:26', 1, '2025-10-02 11:08:34', 0),
('22', 'Mall 交易订单的自动收货 Job', '2', 'tradeOrderAutoReceiveJob', '', '0 * * * * ?', '3', 0, 0, 1, '2023-09-26 19:23:53', 1, '2025-10-02 11:08:36', 0),
('23', 'Mall 交易订单的自动评论 Job', '2', 'tradeOrderAutoCommentJob', '', '0 * * * * ?', '3', 0, 0, 1, '2023-09-26 23:38:29', 1, '2025-10-02 11:08:38', 0),
('24', 'Mall 佣金解冻 Job', '2', 'brokerageRecordUnfreezeJob', '', '0 * * * * ?', '3', 0, 0, 1, '2023-09-28 22:01:46', 1, '2025-10-02 11:08:04', 0),
('25', '访问日志清理 Job', '2', 'accessLogCleanJob', '', '0 0 0 * * ?', '3', 0, 0, 1, '2023-10-03 10:59:41', 1, '2023-10-03 11:01:10', 0),
('26', '错误日志清理 Job', '2', 'errorLogCleanJob', '', '0 0 0 * * ?', '3', 0, 0, 1, '2023-10-03 11:00:43', 1, '2023-10-03 11:01:12', 0),
('27', '任务日志清理 Job', '2', 'jobLogCleanJob', '', '0 0 0 * * ?', '3', 0, 0, 1, '2023-10-03 11:01:33', 1, '2024-09-12 13:40:34', 0),
('33', 'demoJob', '2', 'demoJob', '', '0 * * * * ?', 1, 1, 0, 1, '2024-10-27 19:38:46', 1, '2025-05-10 18:13:54', 0),
('35', '转账订单的同步 Job', '2', 'payTransferSyncJob', '', '0 * * * * ?', 0, 0, 0, 1, '2025-05-10 17:35:54', 1, '2025-05-10 18:13:52', 0),
('36', 'IoT 设备离线检查 Job', '2', 'iotDeviceOfflineCheckJob', '', '0 * * * * ?', 0, 0, 0, 1, '2025-07-03 23:48:44', '"1"', '2025-07-03 23:48:47', 0),
('37', 'IoT OTA 升级推送 Job', '2', 'iotOtaUpgradeJob', '', '0 * * * * ?', 0, 0, 0, 1, '2025-07-03 23:49:07', '"1"', '2025-07-03 23:49:13', 0),
('38', 'Mall 拼团过期 Job', '2', 'combinationRecordExpireJob', '', '0 * * * * ?', 0, 0, 0, 1, '2025-10-02 11:07:11', 1, '2025-10-02 11:07:14', 0),
('39', 'Mall 优惠券过期 Job', '2', 'couponExpireJob', '', '0 * * * * ?', 0, 0, 0, 1, '2025-10-02 11:07:34', 1, '2025-10-02 11:07:37', 0),
('40', 'Mall 商品统计 Job', '2', 'productStatisticsJob', '', '0 0 0 * * ?', 0, 0, 0, 1, '2025-11-22 18:51:25', 1, '2025-11-22 18:56:21', 0);

