SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

INSERT INTO `system_notify_message` (`id`, `user_id`, `user_type`, `template_id`, `template_code`, `template_nickname`, `template_content`, `template_type`, `template_params`, `read_status`, `read_time`, `creator`, `create_time`, `updater`, `update_time`, `deleted`, `tenant_id`) VALUES
('2', 1, '2', 1, 'test', '123', '我是 1，我开始 2 了', 1, '{"name":"1","what":"2"}', 1, '2025-04-21 14:59:37', 1, '2023-01-28 11:44:08', 1, '2025-04-21 14:59:37', 0, 1),
('3', 1, '2', 1, 'test', '123', '我是 1，我开始 2 了', 1, '{"name":"1","what":"2"}', 1, '2025-04-21 14:59:37', 1, '2023-01-28 11:45:04', 1, '2025-04-21 14:59:37', 0, 1),
('4', '103', '2', '2', 'register', '系统消息', '你好，欢迎 哈哈 加入大家庭！', '2', '{"name":"哈哈"}', 0, NULL, 1, '2023-01-28 21:02:20', 1, '2023-01-28 21:02:20', 0, 1),
('5', 1, '2', 1, 'test', '123', '我是 芋艿，我开始 写代码 了', 1, '{"name":"芋艿","what":"写代码"}', 1, '2025-04-21 14:59:37', 1, '2023-01-28 22:21:42', 1, '2025-04-21 14:59:37', 0, 1),
('6', 1, '2', 1, 'test', '123', '我是 芋艿，我开始 写代码 了', 1, '{"name":"芋艿","what":"写代码"}', 1, '2025-04-21 14:59:36', 1, '2023-01-28 22:22:07', 1, '2025-04-21 14:59:36', 0, 1),
('7', 1, '2', 1, 'test', '123', '我是 2，我开始 3 了', 1, '{"name":"2","what":"3"}', 1, '2025-04-21 14:59:35', 1, '2023-01-28 23:45:21', 1, '2025-04-21 14:59:35', 0, 1),
('8', 1, '2', '2', 'register', '系统消息', '你好，欢迎 123 加入大家庭！', '2', '{"name":"123"}', 1, '2025-04-21 14:59:35', 1, '2023-01-28 23:50:21', 1, '2025-04-21 14:59:35', 0, 1),
('9', '247', 1, '4', 'brokerage_withdraw_audit_approve', 'system', '您在2023-09-28 08:35:46提现￥0.09元的申请已通过审核', '2', '{"reason":null,"createTime":"2023-09-28 08:35:46","price":"0.09"}', 0, NULL, 1, '2023-09-28 16:36:22', 1, '2023-09-28 16:36:22', 0, 1),
('10', '247', 1, '4', 'brokerage_withdraw_audit_approve', 'system', '您在2023-09-30 20:59:40提现￥1.00元的申请已通过审核', '2', '{"reason":null,"createTime":"2023-09-30 20:59:40","price":"1.00"}', 0, NULL, 1, '2023-10-03 12:11:34', 1, '2023-10-03 12:11:34', 0, 1);

