SET NAMES utf8mb4;
SET FOREIGN_KEY_CHECKS = 0;

INSERT INTO `system_role` (`id`, `name`, `code`, `sort`, `data_scope`, `data_scope_dept_ids`, `status`, `type`, `remark`, `creator`, `create_time`, `updater`, `update_time`, `deleted`, `tenant_id`) VALUES
(1, '超级管理员', 'super_admin', 1, 1, '', 0, 1, '超级管理员', 'admin', '2021-01-05 17:03:48', '', '2022-02-22 05:08:21', 0, 1),
('2', '普通角色', 'common', '2', '2', '', 0, 1, '普通角色', 'admin', '2021-01-05 17:03:48', '', '2022-02-22 05:08:20', 0, 1),
('3', 'CRM 管理员', 'crm_admin', '2', 1, '', 0, 1, 'CRM 专属角色', 1, '2024-02-24 10:51:13', 1, '2024-02-24 02:51:32', 0, 1),
('109', '租户管理员', 'tenant_admin', 0, 1, '', 0, 1, '系统自动生成', 1, '2022-02-22 00:56:14', 1, '2022-02-22 00:56:14', 0, '121'),
('111', '租户管理员', 'tenant_admin', 0, 1, '', 0, 1, '系统自动生成', 1, '2022-03-07 21:37:58', 1, '2022-03-07 21:37:58', 0, '122'),
('155', '测试数据权限', 'test-dp', '3', '2', '[112,100,102,103,104,105,107,108]', 0, '2', '', 1, '2025-03-31 14:58:06', 1, '2025-09-06 20:15:13', 0, 1);

